Repository: RockCityDev/Alphagram-iOS
Catalog: Telegram/Telegram-iOS/*.lproj/InfoPlist.strings
Languages: ar, be, ca, de, fa, fr, id, ms, nl, pl, pt, ru, tr, uk, uz

# NSContactsUsageDescription
source: Telegram will continuously upload your contacts to its heavily encrypted cloud servers to let you connect with your friends across all your devices.
ar: سيقوم تيليجرام برفع جهات الاتصال الخاصة بك باستمرار إلى خوادم التخزين السحابية ذات التشفير العالي لتتمكن من التواصل مع أصدقائك من خلال جميع أجهزتك.
be: Telegram будзе запампоўваць вашы кантакты на свае моцна абароненыя і зашыфраваныя воблачныя серверы, каб вы маглі кантактаваць са сваімі сябрамі з любой вашай прылады.
ca: Telegram pujarà automàticament els vostres contactes als seus servidors xifrats, perquè pugueu connectar-vos amb els amics des de qualsevol dispositiu.
de: Telegram lädt deine Kontakte durchgehend auf die stark verschlüsselten Cloud Server, damit du dich mit deinen Freunden auf all deinen Geräten verbinden kannst.
fa: تلگرام به طور مداوم مخاطبین شما را به سرورهای اَبری و رمزگذاری شده خود آپلود می‌کند تا شما بتوانید در تمامی دستگاه‌های خود با دوستانتان ارتباط برقرار کنید.
fr: Telegram va synchroniser en continu vos contacts sur ses serveurs chiffrés pour vous permettre de joindre vos amis sur tous vos appareils.
id: Telegram akan terus mengunggah kontak Anda ke penyimpanan awan yang dienkripsi penuh, sehingga Anda dapat terhubung dengan teman Anda di semua perangkat Anda.
ms: Telegram akan sentiasa muat naik kenalan anda ke pelayan awan yang berenkripsi tinggi agar anda boleh berhubung dengan rakan anda di semua peranti anda.
nl: Telegram synchroniseert je contacten continu naar onze zwaar versleutelde Cloud-servers, zodat je contact kunt opnemen met je vrienden vanaf al je apparaten.
pl: Telegram będzie nieprzerwanie przesyłać kontakty do silnie zaszyfrowanych serwerów w chmurze, aby umożliwić ci połączenie się ze znajomymi na wszystkich urządzeniach.
pt: Telegram atualizará continuamente os seus contatos em servidores na nuvem fortemente criptografados para que você se conecte com seus amigos através de todos os seus dispositivos.
ru: Актуальная информация о ваших контактах будет храниться зашифрованной в облаке Telegram, чтобы вы могли связаться с друзьями с любого устройства.
tr: Telegram, arkadaşlarınızla tüm cihazlarınız arasında bağlantı kurmanızı sağlamak için kişilerinizi sürekli olarak şifreli bulut sunucularına yükleyecek.
uk: Telegram завантажуватиме ваші контакти до зашифрованих хмарних серверів, щоб ви могли зʼєднуватися з друзями на всіх пристроях.
uz: Telegram barcha qurilmalaringizdan doʻstlaringiz bilan bogʻlana olishingiz uchun muntazam ravishda kontaktlaringizni kuchli shifrlanadigan bulut serverlariga yuklaydi.

# NSLocationWhenInUseUsageDescription
source: When you send your location to your friends, Telegram needs access to show them a map.
ar: عندما ترغب في مشاركة مكانك مع أصدقائك، تيليجرام يحتاج لصلاحيات لعرض الخريطة لهم.
be: Калі вы адпраўляе месцазнаходжанне сваім сябрам, Telegram патрэбны доступ да сэрвісаў геалакацыі, каб размясціць вас на карце.
ca: Si envieu la vostra ubicació als amics, Telegram requereix accés per a mostra-los un mapa.
de: Wenn du Freunden deinen Standort mitteilen willst, musst du Telegram den Zugriff darauf erlauben.
fa: هنگامی که شما موقعیت مکانی خود را برای دوستانتان ارسال می‌کنید، تلگرام جهت نشان دادن نقشه به آن‌ها نیازمند دسترسی است.
fr: Quand vous envoyez votre position à vos amis, Telegram doit accéder à votre position pour leur montrer une carte.
id: Ketika Anda mengirim lokasi untuk teman, Telegram membutuhkan akses untuk berbagi peta.
ms: Bila anda hantar lokasi anda kepada rakan anda, Telegram perlukan akses untuk tunjuk peta.
nl: Als je je locatie met vrienden wilt delen heeft Telegram toegang nodig om ze een kaart te kunnen tonen.
pl: Gdy wysyłasz swoją lokalizację znajomym, Telegram potrzebuje dostępu, aby pokazać im mapę.
pt: Para enviar sua localização para seus amigos o Telegram precisa de permissão para mostrá-los o mapa.
ru: Когда вы отправляете друзьям геопозицию, Telegram нужно разрешение, чтобы показать им карту.
tr: Konumunuzu arkadaşlarınıza gönderdiğinizde, Telegram'ın onlara bir harita göstermesi için erişmesi gerekiyor.
uk: Коли ви надсилаєте розташування друзям, Telegram потребує доступу, щоб показати їм мапу.
uz: Joylashuvingizni doʻstlaringizga yuborganingizda Telegram ularga xaritani koʻrsatishi uchun ruxsat kerak boʻladi.

# NSLocationAlwaysAndWhenInUseUsageDescription
source: When you choose to share your Live Location with friends in a chat, Telegram needs background access to your location to keep them updated for the duration of the live sharing.
ar: عندما تختار أن تشارك مكانك بشكل حي مع أصدقائك في المحادثة، يحتاج تيليجرام إلى الوصول لموقعك في الخلفية حتى بعد إغلاق تيليجرام خلال فترة المشاركة.
be: Калі вы трансліруеце ваша месцазнаходжанне сябрам у чаце, Telegram патрэбны доступ у фонавым рэжыме да вашага месцазнаходжання, каб абнаўляць яго падчас трансляцыі.
ca: Si trieu de compartir la vostra ubicació en directe amb amics en un xat, Telegram requereix accés en segon pla a la vostra ubicació per a actualitzar-la durant la compartició en directe.
de: Wenn du deinen Live-Standort mit Freunden im Chat teilen möchtest, benötigt Telegram so lange im Hintergrund Zugriff auf deinen Standort, bis du ihn nicht mehr teilen willst.
fa: در صورتی که تصمیم بگیرید موقعیت مکانی لحظه‌ای خود را در یک گفتگو با دوستانتان به اشتراک بگذارید، تلگرام جهت به‌روزرسانی این اطلاعات در طول به اشتراک گذاری لحظه‌ای، باید در پس‌زمینه به موقعیت مکانی شما دسترسی داشته باشد.
fr: Quand vous décidez de partager votre position en temps réel dans un échange, Telegram doit y accéder en arrière-plan pour l'actualiser pendant la durée du partage.
id: Jika Anda memilih untuk membagikan Live Location dengan teman dalam obrolan, Telegram memerlukan akses latar belakang ke lokasi Anda agar lokasi tetap diperbarui selama lokasi langsung dibagikan.
ms: Bila anda pilih untuk kongsi Lokasi Langsung anda dengan rakan dalam chat, Telegram perlu akses latar belakang ke lokasi anda agar lokasi anda sentiasa dikemaskini ketika perkongsian.
nl: Als je ervoor kiest om je huidige locatie te delen met vrienden in een chat heeft Telegram achtergrondtoegang tot je locatie nodig om deze bij te werken tijdens het live-delen.
pl: Gdy zdecydujesz się udostępnić swoją „lokalizację na żywo” znajomym podczas czatu, Telegram potrzebuje dostępu w tle do twojej lokalizacji, aby zapewnić jej aktualizację przez cały czas udostępniania „na żywo”.
pt: Quando você escolhe compartilhar sua Localização em Tempo Real com amigos no chat, o Telegram precisa de acesso à sua localização em segundo plano para mantê-los atualizados durante o compartilhamento.
ru: Фоновый доступ к геопозиции требуется, чтобы обновлять вашу геопозицию, когда вы транслируете её в чат с друзьями.
tr: Canlı Konumunuzu arkadaşlarınızla bir sohbette paylaşmayı seçtiğinizde, Telegram'ın canlı paylaşım süresince onları güncel tutmak için konumunuza arka plan erişimi olması gerekir.
uk: Коли ви захочете поділитися Маячком із друзями у чаті, Telegram потребує фонового доступу до розташування, щоб воно оновлювалося на час трансляції маячка.
uz: Chatda doʻstlarga Jonli joylashuvingizni ulashishni tanlaganingizda, Telegram joylashuvingizni jonli ulashish davomida yangilab turishi uchun undan fonda foydalanishi kerak.

# NSLocationAlwaysUsageDescription
source: When you choose to share your live location with friends in a chat, Telegram needs background access to your location to keep them updated for the duration of the live sharing. You also need this to send locations from an Apple Watch.
ar: عندما تقوم بمشاركة موقعك مع أصدقائك، تيليجرام يحتاج إلى الصلاحية ليعرض لهم الخريطة. كما تحتاج لإعطاء تيليجرام الصلاحية لتتمكن من إرسال موقعك من ساعة آبل.
be: Калі вы трансліруеце ваша месцазнаходжанне сябрам у чаце, Telegram патрэбны доступ у фонавым рэжыме да вашага месцазнаходжання, каб абнаўляць яго падчас трансляцыі. Гэта таксама неабходна для таго, каб адпраўляць месцазнаходжанне праз Apple Watch.
ca: Si trieu de compartir la vostra ubicació en directe amb amics en un xat, Telegram requereix de tenir accés en segon pla a la vostra ubicació per a actualitzar-la durant la compartició en directe. També necessiteu això per a enviar ubicacions des d'un Apple Watch.
de: Wenn du Freunden deinen Standort mitteilen willst, musst du Telegram den Zugriff darauf erlauben. Diese Bereichtigung wird auch für die Apple Watch benötigt.
fa: در صورتی که شما تصمیم بگیرید موقعیت مکانی لحظه‌ای خود را در یک گفتگو با دوستانتان به اشتراک بگذارید، تلگرام جهت به‌روزرسانی این اطلاعات در طول به اشتراک گذاری لحظه‌ای، باید در پس‌زمینه به موقعیت مکانی شما دسترسی داشته باشد. شما همچنین برای ارسال موقعیت مکانی از ساعت اَپل به این دسترسی نیاز دارید.
fr: Quand vous décidez de partager votre position en temps réel dans un échange, Telegram doit y accéder en arrière-plan pour l'actualiser pendant la durée du partage. Cela sert aussi à envoyer une position depuis l'Apple Watch.
id: Jika Anda ingin berbagi Live Location dengan teman dalam chat, Telegram perlu akses latar belakang ke lokasi Anda agar lokasi tetap diperbarui selama lokasi langsung dibagikan. Hal yang sama perlu dilakukan untuk berbagi lokasi dari Apple Watch.
ms: Bila anda pilih untuk kongsi lokasi langsung anda dengan rakan dalam chat, Telegram perlu akses latar belakang agar lokasi anda sentiasa dikemaskini. Anda juga harus hantar lokasi anda ke Jam Apple.
nl: Telegram heeft toegang nodig om een kaart aan je vrienden te tonen als je jouw locatie met ze deelt. Je hebt dit ook nodig om locaties te sturen vanaf een Apple Watch.
pl: Gdy zdecydujesz się udostępnić swoją „lokalizację na żywo” znajomym podczas czatu, Telegram potrzebuje dostępu w tle do twojej lokalizacji, aby zapewnić jej aktualizację przez cały czas udostępniania „na żywo”. Jest to również potrzebne do wysyłania lokalizacji z Apple Watch.
pt: Para enviar sua localização para seus amigos, o Telegram precisa de permissão para mostrá-los o mapa. Você também precisará disso para enviar localizações de um Apple Watch.
ru: Фоновый доступ к геопозиции требуется, чтобы обновлять вашу геопозицию, когда вы транслируете её в чат с друзьями. Он также необходим для отправки геопозиции с Apple Watch.
tr: Canlı konumunuzu bir sohbette arkadaşlarınızla paylaşmayı seçtiğinizde, Telegram'ın canlı paylaşım süresince konumunuzu güncel tutması için bir arka plan erişimi gerekir. Ayrıca Apple Watch'dan konum göndermek için de buna ihtiyacınız var.
uk: Коли ви захочете поділитися Маячком із друзями у чаті, Telegram потребує фонового доступу до розташування, щоб воно оновлювалося на час трансляції маячка. Також вам це потрібно для надсилання розташувань з Apple Watch.
uz: Chatda doʻstlarga Jonli joylashuvingizni ulashishni tanlaganingizda, Telegram joylashuvingizni jonli ulashish davomida yangilab turishi uchun undan fonda foydalanishi kerak. Sizga bu Apple Watchdan joylashuvlarni yuborish uchun ham kerak.

# NSCameraUsageDescription
source: We need this so that you can take and share photos and videos, as well as make video calls.
ar: نحتاج ذلك لتتمكن من التقاط وإرسال الصور والفيديوهات.
be: Нам неабходны гэты дазвол, каб вы маглі рабіць і адпраўляць фота і відэа, а таксама відэавыклікі.
ca: Ens cal això perquè pugueu fer i compartir fotos i vídeos, així com fer videotrucades.
de: Brauchen wir, damit du Bilder und Videos aufnehmen und teilen kannst.
fa: ما به این دسترسی نیاز داریم تا شما بتوانید عکس‌ و ویدیو گرفته و آن‌ها را به اشتراک بگذارید.
fr: Nous en avons besoin pour que vous puissiez prendre et partager des photos et des vidéos.
id: Kami membutuhkan hal ini agar Anda dapat mengambil dan membagikan foto dan video.
ms: Kita perlukan ini agar anda boleh ambil dan kongsi foto dan video, dan juga buat panggilan video.
nl: We hebben dit nodig zodat je foto's en video's kunt maken en delen.
pl: Potrzebujemy tego, aby można było robić i udostępniać zdjęcia i wideo, a także prowadzić rozmowy wideo.
pt: Precisamos acessar sua câmera para que você possa capturar fotos e vídeos.
ru: Это необходимо, чтобы вы могли делиться снятыми фотографиями и видео.
tr: Fotoğraf ve video çekip paylaşabilmeniz ve görüntülü arama yapabilmeniz için buna ihtiyacımız var.
uk: Нам це потрібно, щоб ви могли знімати та ділитися фото й відео.
uz: Bu bizga rasm va videolarga olish, shuningdek, video chaqiruvlar qilish va ularni ulashishingiz uchun kerak.

# NSPhotoLibraryUsageDescription
source: We need this so that you can share photos and videos from your photo library.
ar: نحتاج ذلك لتتمكن من إرسال الصور والفيديوهات من ألبوم الصور.
be: Нам неабходны гэты дазвол, каб вы маглі абагульваць фота і відэа са сваёй галерэі.
ca: Ens cal això perquè pugueu compartir fotos i vídeos de la biblioteca de fotos.
de: Brauchen wir, damit du Bilder und Videos aus deiner Fotomediathek teilen kannst.
fa: ما به این دسترسی نیاز داریم تا شما بتوانید از گالری تصاویر خود عکس و ویدیو به اشتراک بگذارید.
fr: Nous en avons besoin pour que vous puissiez partager des photos et des vidéos de votre photothèque.
id: Kami membutuhkan hal ini agar Anda dapat berbagi foto dan video dari galeri foto Anda.
ms: Kita perlu ini agar anda boleh kongsi foto dan video dari librari foto anda.
nl: We hebben dit nodig zodat je foto's en video's kunt delen vanuit je fotobibliotheek.
pl: Potrzebujemy tego, aby można było udostępniać zdjęcia i wideo ze swojej biblioteki zdjęć.
pt: Precisamos disso para que você possa compartilhar fotos e vídeos de sua galeria.
ru: Это необходимо, чтобы вы могли делиться фото и видео из библиотеки устройства.
tr: Fotoğraf arşivinizdeki fotoğraf ve videoları paylaşabilmeniz için buna ihtiyacımız var.
uk: Нам це потрібно, щоб ви могли ділитися фото та відео з вашої бібліотеки фото.
uz: Bu bizga galereyangizdan rasm va videolaringizni ulasha olishingiz uchun kerak.

# NSPhotoLibraryAddUsageDescription
source: We need this so that you can save photos and videos to your photo library.
ar: نحتاج هذه الصلاحية لتتمكن من حفظ وسائطك في مكتبة الصور الخاصة بك.
be: Нам неабходны гэты дазвол, каб вы маглі захоўваць фота і відэа ў сваю галерэю.
ca: Ens cal això perquè així pugueu desar fotos i vídeos a la biblioteca de fotos.
de: Brauchen wir, damit du Bilder und Videos in deiner Fotomediathek speichern kannst.
fa: ما به این دسترسی نیاز داریم تا شما بتوانید عکس‌ها و ویدیوها را در گالری تصاویر خود ذخیره کنید.
fr: Nous en avons besoin pour que vous puissiez enregistrer des photos et des vidéos dans votre photothèque.
id: Kami membutuhkan hal ini agar Anda dapat menyimpan foto dan video ke galeri foto.
ms: Kita perlu ini agar anda boleh simpan foto dan video ke librari foto anda.
nl: We hebben dit nodig zodat je foto's en video's kunt opslaan in je fotobibliotheek.
pl: Potrzebujemy tego, aby można było zapisywać zdjęcia i wideo w swojej bibliotece zdjęć.
pt: Precisamos disso para que você possa salvar fotos e vídeos em sua galeria de fotos.
ru: Это необходимо, чтобы вы могли сохранять фото и видео в библиотеку устройства.
tr: Fotoğraf arşivine fotoğraf ve video kaydedebilmeniz için buna ihtiyacımız var.
uk: Нам це потрібно, щоб ви могли зберігати фото та відео до вашої бібліотеки фото.
uz: Bu bizga rasm va videolaringizni galereyangizga saqlay olishingiz uchun kerak.

# NSMicrophoneUsageDescription
source: We need this so that you can record and share voice messages and videos with sound.
ar: نحتاج ذلك لتتمكن من تسجيل رسائل صوتية وفيديوهات بالصوت لترسلها..
be: Нам неабходны гэты дазвол, каб вы маглі запісваць і абагульваць галасавыя паведамленні і відэа з гукам.
ca: Ens cal això perquè pugueu enregistrar i compartir missatges de veu i vídeos amb so.
de: Brauchen wir, damit du Sprachnachrichten aufnehmen und Videos mit Ton teilen kannst.
fa: ما به این دسترسی نیاز داریم تا شما بتوانید پیام‌های صوتی و ویدیوهای صدادار را ضبط کرده و به اشتراک بگذارید.
fr: Nous en avons besoin pour que vous puissiez enregistrer et partager des messages vocaux et des vidéos avec du son.
id: Kami butuh hal ini agar Anda dapat merekam dan berbagi pesan audio dan video dengan suara.
ms: Kita perlu ini agar anda boleh rekod dan kongsi mesej suara dan video dengan suara.
nl: We hebben dit nodig zodat je spraakberichten en video's met geluid kunt opnemen en delen.
pl: Potrzebujemy tego, aby można było nagrywać i udostępniać wiadomości głosowe i wideo z dźwiękiem.
pt: Precisamos disso para que você possa gravar mensagens de voz e vídeos com som.
ru: Это необходимо, чтобы вы могли делиться голосовыми сообщениями и видео со звуком.
tr: Sesli mesajları ve videoları ses ile kaydedebilmeniz ve paylaşabilmeniz için buna ihtiyacımız var.
uk: Нам це потрібно, щоб ви могли записувати та ділитися голосовими повідомленнями та відео зі звуком.
uz: Bu bizga ovozli xabarlarni tovush bilan yozishingiz va ulashingiz uchun kerak.

# NSSiriUsageDescription
source: You can use Siri to send messages.
ar: يمكنك استخدام سيري لإرسال رسائلك.
be: Вы можаце адпраўляць паведамленні праз Siri.
ca: Podeu usar Siri per a enviar missatges.
de: Mit Siri kannst du Nachrichten senden.
fa: شما می‌توانید با استفاده از Siri پیام ارسال کنید.
fr: Vous pouvez utiliser Siri pour envoyer des messages.
id: Anda dapat menggunakan Siri untuk mengirim pesan.
ms: Anda boleh guna Siri untuk kirim mesej.
nl: Je kunt Siri gebruiken om berichten te sturen
pl: Możesz użyć Siri do wysyłania wiadomości.
pt: Você pode usar a Siri para enviar mensagens.
ru: Вы можете использовать Siri для отправки сообщений.
tr: Mesaj göndermek için Siri'yi kullanabilirsiniz.
uk: Надсилайте повідомлення з Siri.
uz: Siz xabarlar yuborish uchun Siridan foydalanishingiz mumkin.

# NSFaceIDUsageDescription
source: You can use Face ID to unlock the app.
ar: يمكنك استخدام Face ID لفتح قفل التطبيق.
be: Вы можаце карыстацца Face ID для разблакіравання праграмы.
ca: Podeu emprar Face ID per a desblocar l'aplicació.
de: Mit Face ID kannst du die App entsperren.
fa: شما می‌توانید با استفاده‌ از Face ID قفل برنامه را باز کنید.
fr: Vous pouvez déverrouiller Telegram avec Face ID.
id: Anda dapat menggunakan Face ID untuk membuka kunci aplikasi.
ms: Anda boleh guna ID Muka untuk guna aplikasi.
nl: Je kunt Face ID gebruiken om de app te ontgrendelen.
pl: Możesz użyć Face ID, aby odblokować aplikację.
pt: Você pode usar o Face ID para desbloquear o app.
ru: Вы можете разблокировать приложение с помощью Face ID.
tr: Uygulamanın kilidini açmak için Face ID'yi kullanabilirsiniz.
uk: Розблоковуйте застосунок із Face ID.
uz: Siz ilovani Face ID yordamida ochishingiz mumkin.
